<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>IKEv2</key>
            <dict>
              <key>OnDemandEnabled</key>
                <integer>1</integer>
              <key>OnDemandRules</key>
              <array>
                  <dict>
                    <key>Action</key>
                      <string>Connect</string>
                      <key>InterfaceTypeMatch</key>
                      <string>WiFi</string>
                    <key>URLStringProbe</key>
                      <string>http://captive.apple.com/hotspot-detect.html</string>
                  </dict>
                  <dict>
                    <key>Action</key>
                      <string>Connect</string>
                      <key>InterfaceTypeMatch</key>
                      <string>Cellular</string>
                    <key>URLStringProbe</key>
                      <string>http://captive.apple.com/hotspot-detect.html</string>
                  </dict>
                </array>
                <key>AuthenticationMethod</key>
                <string>Certificate</string>
                <key>ChildSecurityAssociationParameters</key>
                <dict>
                    <key>DiffieHellmanGroup</key>
                    <integer>20</integer>
                    <key>EncryptionAlgorithm</key>
                    <string>AES-256-GCM</string>
                    <key>IntegrityAlgorithm</key>
                    <string>SHA2-512</string>
                    <key>LifeTimeInMinutes</key>
                    <integer>20</integer>
                </dict>
                <key>DeadPeerDetectionRate</key>
                <string>Medium</string>
                <key>DisableMOBIKE</key>
                <integer>0</integer>
                <key>DisableRedirect</key>
                <integer>1</integer>
                <key>EnableCertificateRevocationCheck</key>
                <integer>0</integer>
                <key>EnablePFS</key>
                <true/>
                <key>IKESecurityAssociationParameters</key>
                <dict>
                    <key>DiffieHellmanGroup</key>
                    <integer>20</integer>
                    <key>EncryptionAlgorithm</key>
                    <string>AES-256-GCM</string>
                    <key>IntegrityAlgorithm</key>
                    <string>SHA2-512</string>
                    <key>LifeTimeInMinutes</key>
                    <integer>20</integer>
                </dict>
                <key>LocalIdentifier</key>
                <string>Haoming</string>
                <key>PayloadCertificateUUID</key>
                <string>E2C4C80B-B3BD-5A32-A6CA-307E29C07894</string>
                <key>CertificateType</key>
                <string>ECDSA384</string>
                <key>ServerCertificateIssuerCommonName</key>
                <string>52.64.117.193</string>
                <key>RemoteAddress</key>
                <string>52.64.117.193</string>
                <key>RemoteIdentifier</key>
                <string>52.64.117.193</string>
                <key>UseConfigurationAttributeInternalIPSubnet</key>
                <integer>0</integer>
            </dict>
            <key>IPv4</key>
            <dict>
                <key>OverridePrimary</key>
                <integer>1</integer>
            </dict>
            <key>PayloadDescription</key>
            <string>Configures VPN settings</string>
            <key>PayloadDisplayName</key>
            <string>VPN</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.vpn.managed.D7B2123E-66AF-52D5-9963-AF5542BE9201</string>
            <key>PayloadType</key>
            <string>com.apple.vpn.managed</string>
            <key>PayloadUUID</key>
            <string>D7B2123E-66AF-52D5-9963-AF5542BE9201</string>
            <key>PayloadVersion</key>
            <real>1</real>
            <key>Proxies</key>
            <dict>
                <key>HTTPEnable</key>
                <integer>0</integer>
                <key>HTTPSEnable</key>
                <integer>0</integer>
            </dict>
            <key>UserDefinedName</key>
            <string>Algo VPN 52.64.117.193 IKEv2</string>
            <key>VPNType</key>
            <string>IKEv2</string>
        </dict>
        <dict>
            <key>Password</key>
            <string>ZYKqOG_k</string>
            <key>PayloadCertificateFileName</key>
            <string>Haoming.p12</string>
            <key>PayloadContent</key>
            <data>
            MIIEjQIBAzCCBFMGCSqGSIb3DQEHAaCCBEQEggRAMIIEPDCCAt8GCSqGSIb3DQEHBqCCAtAwggLMAgEAMIICxQYJKoZIhvcNAQcBMBwGCiqGSIb3DQEMAQYwDgQIoawrNwvze+ECAggAgIICmDYCf3QTgJ63isevLy+d6kuJWdtgEzQ5Ue5+LnXZkUhDSkM1JhFzacs2i5j4GCg+S0HmERgdwjW8YuVBF51jqRbZfOdNNjP0Ph+gUT+756zjZXjD0TJtlmhhv5xvQDqeUs9h1IZRDFl7cArFQTRjqWS+WOow1rHADOjRxXSg4mS6MF9mrOX3XyejnPKx/lNiJT4y5lB8UG5K3ji6MgQu/vYj2BfoWwzAlnoYeSzZUOMYQjCHokuxinEDbldaZglDi+stNItuljDdYPYJBWAnE2Cf6bs1LsLSIeu5lw2iy5jLHxniW+XLhN9skSB0SnURCeN2yDik7y0XB6IaDPeN/9StcUN5+8g1OjRk5w50CuuCme3HYiVt8Y1e8Sk6lRULO/uDL3uLDmYEkOeBvt/ugZVkPOsMhlVpvZ/2SvNvplMVhZV1N6Rn5wQ8Ug99Ww82QETdHPIAW6Jtd8VIfaK6HwqCmDDUQrfiPZHyhyfw8t8kCZfCaLNp6/a7ZJa3Pe/U5SOYa2XRwhu0znq7IUzXhap4e2ERQNjqwntmtJN8I12/NUdYQkHsMecEuParORJh6ieLP8Kc/qNO8Py/NPr6owuCL/U0S3jCM+C+eEcVvXjXan56ZZG5G8aDquXdCfxmDzkFDGJcmu89fuquMONJrVPEfnP5yCRnwKR5olbnws5x8JTFJL2vWJNsWcnAP9vlYOcs1/HnpBxl1M6Yu82SaAhzMaQKqbJ+lKEuKa5MET+UjgBwngfdSZvalOgZafupPfVbbQgCfZ/SDNjhv+FtNR35rtNZisYeWD0owwCopmVCF8nCZzZ1htQmktUMJGNNBF0dQxggGKI3Eqtie8V52v8YlFkF4SMxf3tr9Gif5D74vebmRwYij3QwggFVBgkqhkiG9w0BBwGgggFGBIIBQjCCAT4wggE6BgsqhkiG9w0BDAoBAqCB5DCB4TAcBgoqhkiG9w0BDAEDMA4ECPx7iX0QFOwNAgIIAASBwBd7yy+eIqVbXERBv05oeJYOZwpZVzW0EbAN+qEjmePQDb2Ij3eG60+JuboaF5f4dB3iY+kFUsxY9rkUKhQBIPlg0eABCru8lq/hptYFzNOybhtrQAp/UaApKjT024Ezu7brSz+xkXBK+7PgSK40poPyIXqseadpck8LH1RTNUkRdy63HpTUHmvUDIB9jehKcS8wPGroFhlig7tRFkQXCsS/SHoiRiwu8Bv8YtkU9z3FAbA+okBWlOWrpNEq2Qi1NzFEMB0GCSqGSIb3DQEJFDEQHg4ASABhAG8AbQBpAG4AZzAjBgkqhkiG9w0BCRUxFgQUj8fMBKQUm8xv7xvr5yeIHG/UOhQwMTAhMAkGBSsOAwIaBQAEFOcA8lzt3mgL6S/1Qexiy0/UuJAlBAgPbILA7ahFvQICCAA=
            </data>
            <key>PayloadDescription</key>
            <string>Adds a PKCS#12-formatted certificate</string>
            <key>PayloadDisplayName</key>
            <string>Haoming.p12</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.security.pkcs12.E2C4C80B-B3BD-5A32-A6CA-307E29C07894</string>
            <key>PayloadType</key>
            <string>com.apple.security.pkcs12</string>
            <key>PayloadUUID</key>
            <string>E2C4C80B-B3BD-5A32-A6CA-307E29C07894</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
        </dict>
        <dict>
            <key>PayloadCertificateFileName</key>
            <string>ca.crt</string>
            <key>PayloadContent</key>
            <data>
            LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUI3RENDQVhLZ0F3SUJBZ0lKQUpWZHBXL05ncmhtTUFvR0NDcUdTTTQ5QkFNQ01CZ3hGakFVQmdOVkJBTU0KRFRVeUxqWTBMakV4Tnk0eE9UTXdIaGNOTVRneE1qSXhNVEl6TURRNVdoY05Namd4TWpFNE1USXpNRFE1V2pBWQpNUll3RkFZRFZRUUREQTAxTWk0Mk5DNHhNVGN1TVRrek1IWXdFQVlIS29aSXpqMENBUVlGSzRFRUFDSURZZ0FFCjZFOW91OVVmTmw4L2Q4TCt4akdzQnlJbDlSQVVtVDdQdXRGSkIvdThjYldZVlBMRnczOE1ZbzA4QWtIYmNReDUKK3U1WVl2eGpsSDVjMHY1bnhhYjk4TE1lRXhQUWRmaG1sYTBMODBDRUZzdTNNYUhpNVZiVzFtNVhLY1RtaENIRgpvNEdITUlHRU1CMEdBMVVkRGdRV0JCU0NBQ3NoRzNZWEdFMEFpU05FZVJyR0cvd2YyekJJQmdOVkhTTUVRVEEvCmdCU0NBQ3NoRzNZWEdFMEFpU05FZVJyR0cvd2YyNkVjcEJvd0dERVdNQlFHQTFVRUF3d05OVEl1TmpRdU1URTMKTGpFNU00SUpBSlZkcFcvTmdyaG1NQXdHQTFVZEV3UUZNQU1CQWY4d0N3WURWUjBQQkFRREFnRUdNQW9HQ0NxRwpTTTQ5QkFNQ0EyZ0FNR1VDTVFDQUZPUVZaM2RRNkFGaHA4T1dzckhyS25tM0diWGxuUXN0bThNVldIK3dFS0UrCmpNZjZlY3g4MVBlTnNFa1ljYjBDTUJoKzg5VHFsbVZ4dTBMNzJwa1Z1WDd3Y1FHZjZ2NEt3N1U4QklKYkxpWksKWng5OTlZU041TlZrSVNhT09rVGJXUT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0=
            </data>
            <key>PayloadDescription</key>
            <string>Adds a CA root certificate</string>
            <key>PayloadDisplayName</key>
            <string>52.64.117.193</string>
            <key>PayloadIdentifier</key>
            <string>com.apple.security.root.CE5B6957-0598-5D4D-9E1F-3746DB73C698</string>
            <key>PayloadType</key>
            <string>com.apple.security.root</string>
            <key>PayloadUUID</key>
            <string>CE5B6957-0598-5D4D-9E1F-3746DB73C698</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
        </dict>
    </array>
    <key>PayloadDisplayName</key>
    <string>52.64.117.193 IKEv2</string>
    <key>PayloadIdentifier</key>
    <string>donut.local.9852C740-91E9-575A-B0CF-96C6386F9FDE</string>
    <key>PayloadOrganization</key>
	<string>Algo VPN</string>
    <key>PayloadRemovalDisallowed</key>
    <false/>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>4488506D-B353-5180-A117-D3F60426C841</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
</dict>
</plist>
